---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SlantedColumnTypeParam
source: html/384b6fc6-ccd7-f549-21ae-0d7c9ee8c53e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SlantedColumnTypeParam Property

"Column Style"

## Syntax (C#)
```csharp
public static ForgeTypeId SlantedColumnTypeParam { get; }
```